START_TEXT = """<b>Привет! Я бот-помощник от КИБ! 👋</b>

Я ваш помощник по курсу:
<b>"Разработка безопасного ПО и безопасной архитектуры"</b>

<b><b>Я помогу вам:</b></b>
<b>✅ Проверить статус регистрации</b>
<b>📚 Узнать о программе курса</b>
<b>📅 Найти расписание лекций</b>
<b>📧 Связаться с организаторами</b>
"""

MENU_TEXT = "<i>Выберите интересующий вас пункт ниже:</i>"

PROGRAM_TEXT = """<b>📚 Полная программа курса РБПО и РБА</b>

Лекция №1
<b>1. Безопасность WEB приложений</b>
<b>2. Проблемы использования LLM и безопасность кода

Лекция №2
3. Безопасность Linux</b>
<b>4. Безопасная настройка Doсker</b><b>
</b>
<b>Лекция №3
5. Анализ исходного кода и сборки</b>
<b>6. Secure Coding Guidelines</b>
<b>7. Безопасность цепочек поставок ПО</b>
<b>8. Семейство уязвимостей и угроз</b>
<b>
Лекция №4</b>
<b>9. Как работать с фреймворками для РБПО</b>
<b>10. Безопасность многопоточных приложений</b><b>
</b>
<b>Лекция №5</b>
<b>13. Архитектурные концепции ИБ систем</b>
14. Секретная лекция от Дмитрия про архитектуру<b>
</b>
Лекция №6
15. Безопасность микросервисной архитектуры
16. Безопасность в брокерах сообщений
17. Управление доступом, IAM

<b>
18. Телеметрия и мониторинг ИБ</b>
<b>19. BYOD проблемы ИБ</b>
<b>20. РБПО и компьютерная криминалистика</b>
<b>21. Управление персоналом и социальная инженерия</b>
<b>22. Нормативные документы</b>"""

MATERIALS_TEXT = """📖 Основные материалы курса

Получить можно по ссылке."""

CONTACT_TEXT = """<b>💬 Для связи используете общий чат по курсу</b>

Если вас в чат не добавили, то попросите через знакомых, друзей чтобы вас добавили."""

SCHEDULE_EMPTY_TEXT = """<b>Следующая лекция №7 ОНЛАЙН!</b>

📅 <b>Дата:</b> уточняется
🕐 <b>Время:</b> уточняется
💻 <b>Формат:</b> Онлайн

Темы:
Лекция №7
16. Безопасность в брокерах сообщений
17. Управление доступом, IAM

🔗 <b>Ссылка для подключения:
</b>Будет позже."""

REGISTRATION_CLOSED_TEXT = """<b>📝 Регистрация закрыта!</b>

🎓 На данный момент регистрация не доступна!

⏳ Регистрация на остальные лекции откроется позже — следите за обновлениями!"""

QUESTION_PROMPT_TEXT = """<b>Напиши свои вопросы под этим сообщением:</b>

Вопросы могут быть любые, также идеи, предложения, пожелания тоже сюда можно писать

<b>> Ответ на свой вопрос ты получишь в боте</b>
<b>
</b>
<b>Напиши свой вопрос / идею / предложение ниже:
</b>
 P.s. Дмитрий ответит тебе в свободное время
"""

QUESTION_SENT_TEXT = "Сообщение доставлено, ожидайте ответа от Дмитрия"
